org/05-pandas-database/05-pandas-database.org
* Using Pandas DataFrames as a small database

Pandas DataFrames can serve as small databases. You can use them to construct tables from which you can run queries to compute things. In this example, we will explore a database of molecules and atomic element properties.

** A Table for the chemical elements and their atomic masses

You will have to install the Atomic Simulation Environment for this.

#+BEGIN_SRC ipython
! pip install ase
#+END_SRC

We will use it because it has data about the chemical elements, and some molecules we will use.

First, we make a DataFrame containing the chemical elements, and their atomic masses.

#+BEGIN_SRC ipython
import ase
import numpy as np
import pandas as pd

dtypes = np.dtype([('symbol', str), ('atomic mass', float)])
data = np.empty(0, dtype=dtypes)

elements = pd.DataFrame(data)
elements['symbol'] = ase.data.chemical_symbols
elements['atomic mass'] = ase.data.atomic_masses
elements.info()
#+END_SRC

#+RESULTS:
:results:
# Out [5]:
# output
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 119 entries, 0 to 118
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   symbol       119 non-null    object
 1   atomic mass  119 non-null    float64
dtypes: float64(1), object(1)
memory usage: 2.0+ KB

:end:

You can use a =query= function to select rows from the database that meet some criteria.

#+BEGIN_SRC ipython
?elements.query
#+END_SRC

#+RESULTS:
:results:
# Out [9]:
:end:


For example, to get Carbon we can use a query like this.

#+BEGIN_SRC ipython
elements.query('symbol == "C"')
#+END_SRC

#+RESULTS:
:results:
# Out [8]:
# text/plain
:   symbol  atomic mass
: 6      C       12.011

:end:

We can do some things with python variables like this.

#+BEGIN_SRC ipython
sym = 'H'
elements.query('symbol == @sym')
#+END_SRC

#+RESULTS:
:results:
# Out [10]:
# text/plain
:   symbol  atomic mass
: 1      H        1.008


:end:

#+END_SRC

Although, f-strings also work for this.

#+BEGIN_SRC ipython
sym = 'H'
elements.query(f'symbol == "{sym}"')
#+END_SRC

#+RESULTS:
:results:
# Out [11]:
# text/plain
:   symbol  atomic mass
: 1      H        1.008

:end:

The atomic mass is trickier to work with because it has a space in it. We have to use back-ticks to "quote" this.

#+BEGIN_SRC ipython
elements.query('`atomic mass` < 4')
#+END_SRC

#+RESULTS:
:results:
# Out [6]:
# text/plain
:   symbol  atomic mass
: 0      X        1.000
: 1      H        1.008

:end:

Note it does not appear you can use the @ or f-string on column names. Also note the mysterious element X in the table. We can ignore that.

** A Table for some molecules

Next, let's build the molecule database. This will be a table where each row  corresponds to an atom in a molecule. We will be able to get the atoms in a molecule by aggregating these on a =Molecule-ID=. We build this table up row by row, by first getting a molecule, and then iterating over each atom in the molecule. It is conventional to use an integer for an ID, but we will just use the molecular formula in this example. That has some limitations for larger databases (e.g. isomers have different properties, but the same molecular formula), but we will not have that problem here.

#+BEGIN_SRC ipython
df = pd.DataFrame(columns=['Molecule-ID', 'Atom symbol', 'x', 'y', 'z'])

from ase.build import molecule
i = 0

for mlc in ['H2O', 'NH3', 'CH4']:
    for atom in molecule(mlc):
        df.loc[i] = [mlc, atom.symbol, atom.x, atom.y, atom.z]
        i += 1
df
#+END_SRC

#+RESULTS:
:results:
# Out [15]:
# text/plain
:    Molecule-ID Atom symbol         x         y         z
: 0          H2O           O  0.000000  0.000000  0.119262
: 1          H2O           H  0.000000  0.763239 -0.477047
: 2          H2O           H  0.000000 -0.763239 -0.477047
: 3          NH3           N  0.000000  0.000000  0.116489
: 4          NH3           H  0.000000  0.939731 -0.271808
: 5          NH3           H  0.813831 -0.469865 -0.271808
: 6          NH3           H -0.813831 -0.469865 -0.271808
: 7          CH4           C  0.000000  0.000000  0.000000
: 8          CH4           H  0.629118  0.629118  0.629118
: 9          CH4           H -0.629118 -0.629118  0.629118
: 10         CH4           H  0.629118 -0.629118 -0.629118
: 11         CH4           H -0.629118  0.629118 -0.629118


:end:

*** What molecules are in the database?

Ok, now we are ready to do some queries. First, let's see what molecules we have in our database. We want the unique values of the 'Molecule-ID' column.

#+BEGIN_SRC ipython
df['Molecule-ID'].unique()
#+END_SRC

#+RESULTS:
:results:
# Out [17]:
# text/plain
: array(['H2O', 'NH3', 'CH4'], dtype=object)
:end:

*** Which molecules have three H atoms?

Now, how do we find molecules that have 3 H atoms? We need to do some grouping. First, we select the H rows, and then we group by the Molecule-ID Then, we need a count of each sub group. I prefer the =size= function for this over =count=. =size= returns a Series, while =count= seems to return a DataFrame.

#+BEGIN_SRC ipython
tf = df.query('`Atom symbol` == "H"').groupby(['Molecule-ID']).size()
tf
#+END_SRC

#+RESULTS:
:results:
# Out [37]:
# text/plain
: Molecule-ID
: CH4    4
: H2O    2
: NH3    3
: dtype: int64
:end:

Finally, we can select the rows that have 3 hydrogen atoms.

#+BEGIN_SRC ipython
tf[tf == 3]
#+END_SRC

#+RESULTS:
:results:
# Out [38]:
# text/plain
: Molecule-ID
: NH3    3
: dtype: int64
:end:


