docs/05-pandas-database/05-pandas-database.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-05-18 Mon 16:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="John Kitchin" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5a91b90">1. Using Pandas DataFrames as a small database</a>
<ul>
<li><a href="#org0835075">1.1. A Table for the chemical elements and their atomic masses</a></li>
<li><a href="#org2badf70">1.2. A Table for some molecules</a>
<ul>
<li><a href="#orgec53028">1.2.1. What molecules are in the database?</a></li>
<li><a href="#org9c7bafa">1.2.2. Which molecules have three H atoms?</a></li>
</ul>
</li>
<li><a href="#orga7b7d51">1.3. Getting the molecular weight</a></li>
</ul>
</li>
<li><a href="#orgfb385e8">2. Chaining commands in Pandas</a></li>
<li><a href="#org52ce348">3. Subtle points</a></li>
</ul>
</div>
</div>
<div id="outline-container-org5a91b90" class="outline-2">
<h2 id="org5a91b90"><span class="section-number-2">1</span> Using Pandas DataFrames as a small database</h2>
<div class="outline-text-2" id="text-1">
<p>
Pandas DataFrames can serve as small databases. You can use them to construct tables from which you can run queries to compute things. In this example, we will explore a database of molecules and atomic element properties.
</p>
</div>

<div id="outline-container-org0835075" class="outline-3">
<h3 id="org0835075"><span class="section-number-3">1.1</span> A Table for the chemical elements and their atomic masses</h3>
<div class="outline-text-3" id="text-1-1">
<p>
You will have to install the Atomic Simulation Environment for this.
</p>

<div class="org-src-container">
<pre class="src src-ipython">! pip install ase
</pre>
</div>

<p>
We will use it because it has data about the chemical elements, and some molecules we will use.
</p>

<p>
First, we make a DataFrame containing the chemical elements, and their atomic masses.
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #0000FF;">import</span> ase
<span style="color: #0000FF;">import</span> numpy <span style="color: #0000FF;">as</span> np
<span style="color: #0000FF;">import</span> pandas <span style="color: #0000FF;">as</span> pd

<span style="color: #BA36A5;">dtypes</span> = np.dtype([(<span style="color: #008000;">'symbol'</span>, <span style="color: #006FE0;">str</span>), (<span style="color: #008000;">'atomic mass'</span>, <span style="color: #006FE0;">float</span>)])
<span style="color: #BA36A5;">data</span> = np.empty(0, dtype=dtypes)

<span style="color: #BA36A5;">elements</span> = pd.DataFrame(data)
<span style="color: #BA36A5;">elements</span>[<span style="color: #008000;">'symbol'</span>] = ase.data.chemical_symbols
<span style="color: #BA36A5;">elements</span>[<span style="color: #008000;">'atomic mass'</span>] = ase.data.atomic_masses
elements.info()
</pre>
</div>

<p>
&lt;class 'pandas.core.frame.DataFrame'&gt;
RangeIndex: 119 entries, 0 to 118
Data columns (total 2 columns):
</p>

<p>
&#x2014;  -&#x2013;&#x2014;       ---------&#x2013;&#x2014;  &#x2013;&#x2014;
 0   symbol       119 non-null    object
 1   atomic mass  119 non-null    float64
dtypes: float64(1), object(1)
memory usage: 2.0+ KB
</p>

<p>
You can use a <code>query</code> function to select rows from the database that meet some criteria.
</p>

<div class="org-src-container">
<pre class="src src-ipython">?elements.query
</pre>
</div>

<p>
For example, to get Carbon we can use a query like this.
</p>

<div class="org-src-container">
<pre class="src src-ipython">elements.query(<span style="color: #008000;">'symbol == "C"'</span>)
</pre>
</div>

<pre class="example">
  symbol  atomic mass
6      C       12.011
</pre>

<p>
We can do some things with python variables like this.
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #BA36A5;">sym</span> = <span style="color: #008000;">'H'</span>
elements.query(<span style="color: #008000;">'symbol == @sym'</span>)
</pre>
</div>

<pre class="example">
  symbol  atomic mass
1      H        1.008
</pre>

<p>
#+END_SRC
</p>

<p>
Although, f-strings also work for this.
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #BA36A5;">sym</span> = <span style="color: #008000;">'H'</span>
elements.query(f<span style="color: #008000;">'symbol == "</span><span style="color: #BA36A5;">{sym}</span><span style="color: #008000;">"'</span>)
</pre>
</div>

<pre class="example">
  symbol  atomic mass
1      H        1.008
</pre>

<p>
The atomic mass is trickier to work with because it has a space in it. We have to use back-ticks to "quote" this.
</p>

<div class="org-src-container">
<pre class="src src-ipython">elements.query(<span style="color: #008000;">'`</span><span style="color: #D0372D;">atomic mass` &lt; 4</span><span style="color: #008000;">'</span>)
</pre>
</div>

<pre class="example">
  symbol  atomic mass
0      X        1.000
1      H        1.008
</pre>

<p>
Note it does not appear you can use the @ or f-string on column names. Also note the mysterious element X in the table. We can ignore that.
</p>
</div>
</div>

<div id="outline-container-org2badf70" class="outline-3">
<h3 id="org2badf70"><span class="section-number-3">1.2</span> A Table for some molecules</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Next, let's build the molecule database. This will be a table where each row  corresponds to an atom in a molecule. We will be able to get the atoms in a molecule by aggregating these on a <code>Molecule-ID</code>. We build this table up row by row, by first getting a molecule, and then iterating over each atom in the molecule. It is conventional to use an integer for an ID, but we will just use the molecular formula in this example. That has some limitations for larger databases (e.g. isomers have different properties, but the same molecular formula), but we will not have that problem here.
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #BA36A5;">df</span> = pd.DataFrame(columns=[<span style="color: #008000;">'Molecule-ID'</span>, <span style="color: #008000;">'Atom symbol'</span>, <span style="color: #008000;">'x'</span>, <span style="color: #008000;">'y'</span>, <span style="color: #008000;">'z'</span>])

<span style="color: #0000FF;">from</span> ase.build <span style="color: #0000FF;">import</span> molecule
<span style="color: #BA36A5;">i</span> = 0

<span style="color: #0000FF;">for</span> mlc <span style="color: #0000FF;">in</span> [<span style="color: #008000;">'H2O'</span>, <span style="color: #008000;">'NH3'</span>, <span style="color: #008000;">'CH4'</span>]:
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #0000FF;">for</span> atom <span style="color: #0000FF;">in</span> molecule(mlc):
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #BA36A5;">df.loc</span>[i] = [mlc, atom.symbol, atom.x, atom.y, atom.z]
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #BA36A5;">i</span> += 1
df
</pre>
</div>

<pre class="example">
   Molecule-ID Atom symbol         x         y         z
0          H2O           O  0.000000  0.000000  0.119262
1          H2O           H  0.000000  0.763239 -0.477047
2          H2O           H  0.000000 -0.763239 -0.477047
3          NH3           N  0.000000  0.000000  0.116489
4          NH3           H  0.000000  0.939731 -0.271808
5          NH3           H  0.813831 -0.469865 -0.271808
6          NH3           H -0.813831 -0.469865 -0.271808
7          CH4           C  0.000000  0.000000  0.000000
8          CH4           H  0.629118  0.629118  0.629118
9          CH4           H -0.629118 -0.629118  0.629118
10         CH4           H  0.629118 -0.629118 -0.629118
11         CH4           H -0.629118  0.629118 -0.629118
</pre>
</div>

<div id="outline-container-orgec53028" class="outline-4">
<h4 id="orgec53028"><span class="section-number-4">1.2.1</span> What molecules are in the database?</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Ok, now we are ready to do some queries. First, let's see what molecules we have in our database. We want the unique values of the 'Molecule-ID' column.
</p>

<div class="org-src-container">
<pre class="src src-ipython">df[<span style="color: #008000;">'Molecule-ID'</span>].unique()
</pre>
</div>

<pre class="example">
array(['H2O', 'NH3', 'CH4'], dtype=object)
</pre>
</div>
</div>

<div id="outline-container-org9c7bafa" class="outline-4">
<h4 id="org9c7bafa"><span class="section-number-4">1.2.2</span> Which molecules have three H atoms?</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Now, how do we find molecules that have 3 H atoms? We need to do some grouping. First, we select the H rows, and then we group by the Molecule-ID Then, we need a count of each sub group. I prefer the <code>size</code> function for this over <code>count</code>. <code>size</code> returns a Series, while <code>count</code> seems to return a DataFrame.
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #BA36A5;">tf</span> = df.query(<span style="color: #008000;">'`</span><span style="color: #D0372D;">Atom symbol` == "H"</span><span style="color: #008000;">'</span>).groupby([<span style="color: #008000;">'Molecule-ID'</span>]).size()
tf
</pre>
</div>

<pre class="example">
Molecule-ID
CH4    4
H2O    2
NH3    3
dtype: int64
</pre>

<p>
Finally, we can select the rows that have 3 hydrogen atoms.
</p>

<div class="org-src-container">
<pre class="src src-ipython">tf[tf == 3]
</pre>
</div>

<pre class="example">
Molecule-ID
NH3    3
dtype: int64
</pre>
</div>
</div>
</div>
