org/05-pandas-database/05-pandas-database.org
** Getting the molecular weight

Getting the molecular weight requires us to combine information from two DataFrames. To do this, we need to merge them, aligning the rows on a common key. That key is the =Atom symbol= in the molecule DataFrame, and =symbol= in the elements DataFrame. Then we have to do the right grouping, and use the sum aggregation method on each group.

#+BEGIN_SRC ipython
mf = pd.merge(df, elements, how='inner', left_on='Atom symbol', right_on='symbol')
mf
#+END_SRC

#+RESULTS:
:results:
# Out [41]:
# text/plain
:    Molecule-ID Atom symbol         x         y         z symbol  atomic mass
: 0          H2O           O  0.000000  0.000000  0.119262      O       15.999
: 1          H2O           H  0.000000  0.763239 -0.477047      H        1.008
: 2          H2O           H  0.000000 -0.763239 -0.477047      H        1.008
: 3          NH3           H  0.000000  0.939731 -0.271808      H        1.008
: 4          NH3           H  0.813831 -0.469865 -0.271808      H        1.008
: 5          NH3           H -0.813831 -0.469865 -0.271808      H        1.008
: 6          CH4           H  0.629118  0.629118  0.629118      H        1.008
: 7          CH4           H -0.629118 -0.629118  0.629118      H        1.008
: 8          CH4           H  0.629118 -0.629118 -0.629118      H        1.008
: 9          CH4           H -0.629118  0.629118 -0.629118      H        1.008
: 10         NH3           N  0.000000  0.000000  0.116489      N       14.007
: 11         CH4           C  0.000000  0.000000  0.000000      C       12.011


:end:

Now, we group by the =Molecule-ID=, select the =atomic mass= column, and aggregate with the sum.

#+BEGIN_SRC ipython
MW = mf.groupby('Molecule-ID')['atomic mass'].sum()
MW
#+END_SRC

#+RESULTS:
:results:
# Out [43]:
# text/plain
: Molecule-ID
: CH4    16.043
: H2O    18.015
: NH3    17.031
: Name: atomic mass, dtype: float64
:end:

Here is one of many ways to print this in a different format:

#+BEGIN_SRC ipython
for mlc, mw in MW.iteritems():
    print(f'The molecular weight of {mlc} is {mw} gm/mol')
#+END_SRC

#+RESULTS:
:results:
# Out [44]:
# output
The molecular weight of CH4 is 16.043 gm/mol
The molecular weight of H2O is 18.015 gm/mol
The molecular weight of NH3 is 17.031 gm/mol

:end:

* Chaining commands in Pandas

So far, we have mostly seen sequential commands in Pandas

#+BEGIN_SRC ipython
tf = df.query('`Atom symbol` == "H"').groupby(['Molecule-ID']).size()
tf[tf == 3]
#+END_SRC

#+RESULTS:
:results:
# Out [45]:
# text/plain
: Molecule-ID
: NH3    3
: dtype: int64
:end:

The =query= lets us chain these all into one line.

#+BEGIN_SRC ipython
df.query('`Atom symbol` == "H"').groupby(['Molecule-ID']).count().query("`Atom symbol` == 3")
#+END_SRC

#+RESULTS:
:results:
# Out [73]:
# text/plain
:              Atom symbol  x  y  z
: Molecule-ID
: NH3                    3  3  3  3


:end:

It is common to see this syntax where parentheses allow us to separate these into multiple lines. This may enhance readability.

#+BEGIN_SRC ipython
(df
 .query('`Atom symbol` == "H"')
 .groupby(['Molecule-ID'])
 .count()
 .query("`Atom symbol` == 3"))
#+END_SRC

#+RESULTS:
:results:
# Out [72]:
# text/plain
:              Atom symbol  x  y  z
: Molecule-ID
: NH3                    3  3  3  3


:end:

The main benefit of chaining is that you do not have to define temporary variables that exist only so you can reuse them in subsequent lines. The downside is it is more challenging to debug them, and it is common to build them iteratively in a notebook.

Here is another example of chaining to get the molecular weight of water.

#+BEGIN_SRC ipython
(pd.merge(df, elements, how='inner',
          left_on='Atom symbol', right_on='symbol')
 .groupby('Molecule-ID')['atomic mass']
 .sum()
 ['H2O'])
#+END_SRC

#+RESULTS:
:results:
# Out [71]:
# text/plain
: 18.015
:end:

