docs/05-pandas-database/05-pandas-database.html


<div id="outline-container-orga7b7d51" class="outline-3">
<h3 id="orga7b7d51"><span class="section-number-3">1.3</span> Getting the molecular weight</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Getting the molecular weight requires us to combine information from two DataFrames. To do this, we need to merge them, aligning the rows on a common key. That key is the <code>Atom symbol</code> in the molecule DataFrame, and <code>symbol</code> in the elements DataFrame. Then we have to do the right grouping, and use the sum aggregation method on each group.
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #BA36A5;">mf</span> = pd.merge(df, elements, how=<span style="color: #008000;">'inner'</span>, left_on=<span style="color: #008000;">'Atom symbol'</span>, right_on=<span style="color: #008000;">'symbol'</span>)
mf
</pre>
</div>

<pre class="example">
   Molecule-ID Atom symbol         x         y         z symbol  atomic mass
0          H2O           O  0.000000  0.000000  0.119262      O       15.999
1          H2O           H  0.000000  0.763239 -0.477047      H        1.008
2          H2O           H  0.000000 -0.763239 -0.477047      H        1.008
3          NH3           H  0.000000  0.939731 -0.271808      H        1.008
4          NH3           H  0.813831 -0.469865 -0.271808      H        1.008
5          NH3           H -0.813831 -0.469865 -0.271808      H        1.008
6          CH4           H  0.629118  0.629118  0.629118      H        1.008
7          CH4           H -0.629118 -0.629118  0.629118      H        1.008
8          CH4           H  0.629118 -0.629118 -0.629118      H        1.008
9          CH4           H -0.629118  0.629118 -0.629118      H        1.008
10         NH3           N  0.000000  0.000000  0.116489      N       14.007
11         CH4           C  0.000000  0.000000  0.000000      C       12.011
</pre>

<p>
Now, we group by the <code>Molecule-ID</code>, select the <code>atomic mass</code> column, and aggregate with the sum.
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #BA36A5;">MW</span> = mf.groupby(<span style="color: #008000;">'Molecule-ID'</span>)[<span style="color: #008000;">'atomic mass'</span>].<span style="color: #006FE0;">sum</span>()
MW
</pre>
</div>

<pre class="example">
Molecule-ID
CH4    16.043
H2O    18.015
NH3    17.031
Name: atomic mass, dtype: float64
</pre>

<p>
Here is one of many ways to print this in a different format:
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #0000FF;">for</span> mlc, mw <span style="color: #0000FF;">in</span> MW.iteritems():
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #0000FF;">print</span>(f<span style="color: #008000;">'The molecular weight of </span><span style="color: #BA36A5;">{mlc}</span><span style="color: #008000;"> is </span><span style="color: #BA36A5;">{mw}</span><span style="color: #008000;"> gm/mol'</span>)
</pre>
</div>

<p>
The molecular weight of CH4 is 16.043 gm/mol
The molecular weight of H2O is 18.015 gm/mol
The molecular weight of NH3 is 17.031 gm/mol
</p>
</div>
</div>
</div>

<div id="outline-container-orgfb385e8" class="outline-2">
<h2 id="orgfb385e8"><span class="section-number-2">2</span> Chaining commands in Pandas</h2>
<div class="outline-text-2" id="text-2">
<p>
So far, we have mostly seen sequential commands in Pandas
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #BA36A5;">tf</span> = df.query(<span style="color: #008000;">'`</span><span style="color: #D0372D;">Atom symbol` == "H"</span><span style="color: #008000;">'</span>).groupby([<span style="color: #008000;">'Molecule-ID'</span>]).size()
tf[tf == 3]
</pre>
</div>

<pre class="example">
Molecule-ID
NH3    3
dtype: int64
</pre>

<p>
The <code>query</code> lets us chain these all into one line.
</p>

<div class="org-src-container">
<pre class="src src-ipython">df.query(<span style="color: #008000;">'`</span><span style="color: #D0372D;">Atom symbol` == "H"</span><span style="color: #008000;">'</span>).groupby([<span style="color: #008000;">'Molecule-ID'</span>]).count().query(<span style="color: #008000;">"`Atom symbol` == 3"</span>)
</pre>
</div>

<pre class="example">
             Atom symbol  x  y  z
Molecule-ID
NH3                    3  3  3  3
</pre>

<p>
It is common to see this syntax where parentheses allow us to separate these into multiple lines. This may enhance readability.
</p>

<div class="org-src-container">
<pre class="src src-ipython">(df
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>.query(<span style="color: #008000;">'`</span><span style="color: #D0372D;">Atom symbol` == "H"</span><span style="color: #008000;">'</span>)
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>.groupby([<span style="color: #008000;">'Molecule-ID'</span>])
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>.count()
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>.query(<span style="color: #008000;">"`Atom symbol` == 3"</span>))
</pre>
</div>

<pre class="example">
             Atom symbol  x  y  z
Molecule-ID
NH3                    3  3  3  3
</pre>

<p>
The main benefit of chaining is that you do not have to define temporary variables that exist only so you can reuse them in subsequent lines. The downside is it is more challenging to debug them, and it is common to build them iteratively in a notebook.
</p>

<p>
Here is another example of chaining to get the molecular weight of water.
</p>

<div class="org-src-container">
<pre class="src src-ipython">(pd.merge(df, elements, how=<span style="color: #008000;">'inner'</span>,
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #4C9ED9; background-color: #ffffff;"> </span> left_on=<span style="color: #008000;">'Atom symbol'</span>, right_on=<span style="color: #008000;">'symbol'</span>)
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>.groupby(<span style="color: #008000;">'Molecule-ID'</span>)[<span style="color: #008000;">'atomic mass'</span>]
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>.<span style="color: #006FE0;">sum</span>()
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>[<span style="color: #008000;">'H2O'</span>])
</pre>
</div>

<pre class="example">
18.015
</pre>
</div>
</div>
