org/05-pandas-database/05-pandas-database.org
* Subtle points

Pandas offers many ways to do what appear to be the same thing, but they are not. For example, this works:

#+BEGIN_SRC ipython
(df
 .query('`Atom symbol` == "H"')
 .groupby(['Molecule-ID'])
 .count()
 .query("`Atom symbol` == 3"))
#+END_SRC

And this doesn't.

#+BEGIN_SRC ipython
(df
 .query('`Atom symbol` == "H"')
 .groupby(['Molecule-ID'])
 .size()
 .query("`Atom symbol` == 3"))
#+END_SRC

#+RESULTS:
:results:
# Out [74]:
# output
---------------------------------------------------------------------------
AttributeError                            Traceback (most recent call last)
<ipython-input-74-2b7aa4426677> in <module>
      1 (df
      2  .query('`Atom symbol` == "H"')
----> 3  .groupby(['Molecule-ID'])
      4  .size()
      5  .query("`Atom symbol` == 3"))

~/opt/anaconda3/lib/python3.7/site-packages/pandas/core/generic.py in __getattr__(self, name)
   5272             if self._info_axis._can_hold_identifiers_and_holds_name(name):
   5273                 return self[name]
-> 5274             return object.__getattribute__(self, name)
   5275
   5276     def __setattr__(self, name: str, value) -> None:

AttributeError: 'Series' object has no attribute 'query'
:end:

The problem is the =size= function here returns Series, and you cannot query a series. We can get back to this with some acrobatics.

#+BEGIN_SRC ipython
(df
 .query('`Atom symbol` == "H"')
 .groupby(['Molecule-ID'])
 .size()  # This is a series
 .rename('counts') # we give the Series a name
 .to_frame() # Convert to dataframe so we can query
 .query('counts == 3'))
#+END_SRC

#+RESULTS:
:results:
# Out [89]:
# text/plain
:              counts
: Molecule-ID
: NH3               3


:end:

In the beginning, it will be challenging to remember all of this, and figure out how to debug it. With practice, it will get easier!

The Pandas manual (https://pandas.pydata.org/docs/pandas.pdf) is ~3000 pages long! You cannot learn it all, and most likely you don't need to as it covers a lot of use cases that may fall outside your needs.

It is also challenging that there are many ways to do the same thing. For example, here we solve this problem in a different way that has a subtly different syntax. You cannot just cut and paste bits of code between these two examples without knowing what each one does.

#+BEGIN_SRC ipython
(df
 .query('`Atom symbol` == "H"')
 .groupby(['Molecule-ID'])
 .agg({'Atom symbol' :'size'}) # Now this is dataframe
 .query('`Atom symbol` == 3'))
#+END_SRC

#+RESULTS:
:results:
# Out [95]:
# text/plain
:              Atom symbol
: Molecule-ID
: NH3                    3


:end:

How do you learn/remember these? One way is reading lots of code, and running lots of code. You can read code in the manual. You can also use the notebook to access documentation on these methods.

Here are some of the commands we used today,

#+BEGIN_SRC ipython
?pd.DataFrame.query
#+END_SRC

#+RESULTS:
:results:
# Out [97]:
:end:

#+BEGIN_SRC ipython
?pd.DataFrame.groupby
#+END_SRC

#+RESULTS:
:results:
# Out [103]:
:end:

Getting help on the =agg= command is a little trickier. There are several =agg= functions, so we want to make sure we get the one that is relevant to the result from a =groupby= call. First, we get the type of things that is returned:


#+BEGIN_SRC ipython
type(df
 .query('`Atom symbol` == "H"')
 .groupby(['Molecule-ID']))
#+END_SRC

#+RESULTS:
:results:
# Out [106]:
# text/plain
: pandas.core.groupby.generic.DataFrameGroupBy
:end:

Then, we get the help for that thing.

#+BEGIN_SRC ipython
?pd.core.groupby.generic.DataFrameGroupBy.agg
#+END_SRC

#+RESULTS:
:results:
# Out [107]:
:end:

#+BEGIN_SRC ipython
?pd.Series.to_frame
#+END_SRC

#+RESULTS:
:results:
# Out [100]:
:end:


#+BEGIN_SRC ipython
?pd.Series.rename
#+END_SRC
