docs/05-pandas-database/05-pandas-database.html

<div id="outline-container-org52ce348" class="outline-2">
<h2 id="org52ce348"><span class="section-number-2">3</span> Subtle points</h2>
<div class="outline-text-2" id="text-3">
<p>
Pandas offers many ways to do what appear to be the same thing, but they are not. For example, this works:
</p>

<div class="org-src-container">
<pre class="src src-ipython">(df
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>.query(<span style="color: #008000;">'`</span><span style="color: #D0372D;">Atom symbol` == "H"</span><span style="color: #008000;">'</span>)
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>.groupby([<span style="color: #008000;">'Molecule-ID'</span>])
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>.count()
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>.query(<span style="color: #008000;">"`Atom symbol` == 3"</span>))
</pre>
</div>

<p>
And this doesn't.
</p>

<div class="org-src-container">
<pre class="src src-ipython">(df
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>.query(<span style="color: #008000;">'`</span><span style="color: #D0372D;">Atom symbol` == "H"</span><span style="color: #008000;">'</span>)
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>.groupby([<span style="color: #008000;">'Molecule-ID'</span>])
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>.size()
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>.query(<span style="color: #008000;">"`Atom symbol` == 3"</span>))
</pre>
</div>

<hr />
<p>
AttributeError                            Traceback (most recent call last)
&lt;ipython-input-74-2b7aa4426677&gt; in &lt;module&gt;
      1 (df
      2  .query('`Atom symbol` == "H"')
-&#x2014;&gt; 3  .groupby(['Molecule-ID'])
      4  .size()
      5  .query("`Atom symbol` == 3"))
</p>

<p>
~/opt/anaconda3/lib/python3.7/site-packages/pandas/core/generic.py in __getattr__(self, name)
   5272             if self._info_axis._can_hold_identifiers_and_holds_name(name):
   5273                 return self[name]
-&gt; 5274             return object.__getattribute__(self, name)
   5275
   5276     def __setattr__(self, name: str, value) -&gt; None:
</p>

<p>
AttributeError: 'Series' object has no attribute 'query'
</p>

<p>
The problem is the <code>size</code> function here returns Series, and you cannot query a series. We can get back to this with some acrobatics.
</p>

<div class="org-src-container">
<pre class="src src-ipython">(df
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>.query(<span style="color: #008000;">'`</span><span style="color: #D0372D;">Atom symbol` == "H"</span><span style="color: #008000;">'</span>)
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>.groupby([<span style="color: #008000;">'Molecule-ID'</span>])
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>.size()  <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">This is a series</span>
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>.rename(<span style="color: #008000;">'counts'</span>) <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">we give the Series a name</span>
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>.to_frame() <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Convert to dataframe so we can query</span>
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>.query(<span style="color: #008000;">'counts == 3'</span>))
</pre>
</div>

<pre class="example">
             counts
Molecule-ID
NH3               3
</pre>

<p>
In the beginning, it will be challenging to remember all of this, and figure out how to debug it. With practice, it will get easier!
</p>

<p>
The Pandas manual (<a href="https://pandas.pydata.org/docs/pandas.pdf">https://pandas.pydata.org/docs/pandas.pdf</a>) is ~3000 pages long! You cannot learn it all, and most likely you don't need to as it covers a lot of use cases that may fall outside your needs.
</p>

<p>
It is also challenging that there are many ways to do the same thing. For example, here we solve this problem in a different way that has a subtly different syntax. You cannot just cut and paste bits of code between these two examples without knowing what each one does.
</p>

<div class="org-src-container">
<pre class="src src-ipython">(df
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>.query(<span style="color: #008000;">'`</span><span style="color: #D0372D;">Atom symbol` == "H"</span><span style="color: #008000;">'</span>)
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>.groupby([<span style="color: #008000;">'Molecule-ID'</span>])
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>.agg({<span style="color: #008000;">'Atom symbol'</span> :<span style="color: #008000;">'size'</span>}) <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Now this is dataframe</span>
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>.query(<span style="color: #008000;">'`</span><span style="color: #D0372D;">Atom symbol` == 3</span><span style="color: #008000;">'</span>))
</pre>
</div>

<pre class="example">
             Atom symbol
Molecule-ID
NH3                    3
</pre>

<p>
How do you learn/remember these? One way is reading lots of code, and running lots of code. You can read code in the manual. You can also use the notebook to access documentation on these methods.
</p>

<p>
Here are some of the commands we used today,
</p>

<div class="org-src-container">
<pre class="src src-ipython">?pd.DataFrame.query
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ipython">?pd.DataFrame.groupby
</pre>
</div>

<p>
Getting help on the <code>agg</code> command is a little trickier. There are several <code>agg</code> functions, so we want to make sure we get the one that is relevant to the result from a <code>groupby</code> call. First, we get the type of things that is returned:
</p>


<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #006FE0;">type</span>(df
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>.query(<span style="color: #008000;">'`</span><span style="color: #D0372D;">Atom symbol` == "H"</span><span style="color: #008000;">'</span>)
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>.groupby([<span style="color: #008000;">'Molecule-ID'</span>]))
</pre>
</div>

<pre class="example">
pandas.core.groupby.generic.DataFrameGroupBy
</pre>

<p>
Then, we get the help for that thing.
</p>

<div class="org-src-container">
<pre class="src src-ipython">?pd.core.groupby.generic.DataFrameGroupBy.agg
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ipython">?pd.Series.to_frame
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ipython">?pd.Series.rename
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: John Kitchin</p>
<p class="date">Created: 2020-05-18 Mon 16:07</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
